# Indexing & Selection & Filtering in Pandas

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
obj=pd.Series(np.arange(5),
              index=["a","b","c","d","e"])

In [ ]:
obj

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [ ]:
obj["c"]

2

In [ ]:
obj[2]

2

In [ ]:
obj[0:3]

a    0
b    1
c    2
dtype: int32

In [ ]:
obj[["a","c"]]

a    0
c    2
dtype: int32

In [ ]:
obj[[0,2]]

a    0
c    2
dtype: int32

In [ ]:
obj[obj<2]

a    0
b    1
dtype: int32

In [ ]:
obj["a":"c"]

a    0
b    1
c    2
dtype: int32

In [ ]:
obj["b":"c"]=5
obj

a    0
b    5
c    5
d    3
e    4
dtype: int32

## DataFrame Indexing

In [ ]:
data=pd.DataFrame(
    np.arange(16).reshape(4,4),
    index=["London","Paris",
           "Berlin","Istanbul"],
    columns=["one","two","three","four"])
data

          one  two  three  four
London      0    1      2     3
Paris       4    5      6     7
Berlin      8    9     10    11
Istanbul   12   13     14    15

In [ ]:
data["two"]

London       1
Paris        5
Berlin       9
Istanbul    13
Name: two, dtype: int32

In [ ]:
data[["one","two"]]

          one  two
London      0    1
Paris       4    5
Berlin      8    9
Istanbul   12   13

In [ ]:
data[:3]

        one  two  three  four
London    0    1      2     3
Paris     4    5      6     7
Berlin    8    9     10    11

In [ ]:
data[data["four"]>5]

          one  two  three  four
Paris       4    5      6     7
Berlin      8    9     10    11
Istanbul   12   13     14    15

In [ ]:
data[data<5]=0
data

          one  two  three  four
London      0    0      0     0
Paris       0    5      6     7
Berlin      8    9     10    11
Istanbul   12   13     14    15

## Selecting with iloc and loc

In [ ]:
data.iloc[1]

one      0
two      5
three    6
four     7
Name: Paris, dtype: int32

In [ ]:
data.iloc[1,[1,2,3]]

two      5
three    6
four     7
Name: Paris, dtype: int32

In [ ]:
data.iloc[[1,3],[1,2,3]]

          two  three  four
Paris       5      6     7
Istanbul   13     14    15

In [ ]:
data.loc["Paris",["one","two"]]

one    0
two    5
Name: Paris, dtype: int32

In [ ]:
data.loc[:"Paris","four"]

London    0
Paris     7
Name: four, dtype: int32

In [ ]:
toy_data=pd.Series(np.arange(5),
                   index=["a","b","c",
                          "d","e"])
toy_data

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [ ]:
toy_data[-1]

4